<template lang="pug">
.article
  .article-wrapper
  .content
    h1.title Сдай свой старый чехол и получи скидку
    .text {{ p1 }}
</template>

<script>
export default{
  name: 'BeregiOssetiu',
  data () {
    return {
      p1: 'СОБЕРИ МУСОР — ПОЛУЧИ ПОДАРОК❗ \n\n Северная Осетия — это ущелья, которые завораживают какой-то нереальной красотой, это леса и реки, водопады и горы. А еще это старинные поселения, которые много веков хранят энергетику тех, кто здесь когда-то жил, это религиозные памятники — многочисленные старинные храмы… и все это — на фоне гор мусора! \n\n Давайте вместе сохраним природу Осетии в первозданном виде!',
      img1: require('~/assets/images/bes.jpg'),
      p2: 'Ведь, к сожалению, далеко не каждый, кто отправляется на природу понимает, что все, принесенное с собой, надо унести обратно. \n Результат плачевен: уникальные природные пейзажи «украшают» бутылки, пакеты и прочие следы пребывания человека. \n Мы понимаем, что увозить мусор после себя на природе — труд. Делать это за другими — двойной труд. А мы твердо уверены, что любой труд должен быть вознагражден!',
      img2: require('~/assets/images/horses.jpg'),
      p3: 'Поэтому мы сочтем за честь, если вы решите поддержать нашу эко-акцию и поучаствуете в ней. Для этого всего лишь нужно: \n\n ☑ Собрать мусор в Осетии (природа, горы) \n☑ Сфотографировать как было ДО. Как стало чисто ПОСЛЕ (можно и видео) \n ☑ Вывезти мусор \n☑ Опубликовать результат в сторис или ленте и обязательно отметить наш аккаунт @myossetia с тегом #берегиосетию \n☑ Каждого сделавшего ждет подарок (кружка или сертификат на 500₽) \n \nГлавная цель, которую мы ставим перед собой — изменить отношение человека к природе. \n\nС любовью, Твоя Осетия!'
    }
  }
}  
</script>

<style scoped lang="scss">
.article{
  .article-wrapper{
    width: 100%;
    height: 200px;
    background-size: cover;
    background-image: url(~/assets/images/beregi-wr.webp);
    margin-bottom: 32px;
    @media(min-width: 768px){
      height: 400px;
      background-position: center;
    }
  }
  .content{
    padding: 16px;
    @media(min-width: 1200px){
      width: 900px;
      margin: 0 auto;
    }
    .title{
      font-size: 24px;
      margin-bottom: 16px;
    }
    img{
      max-width: 100%;
      margin-bottom: 16px;
    }
    .text{
      margin-bottom: 16px;
      white-space: pre-line;
      line-height: 1.5;
    }
  }
}

</style>