<template lang = pug>
.about
  h2 О нашей компании
  .text(v-html="text") {{ text }}
</template>

<script>
export default{
  name: 'AboutUs',
  data() {
    return {
      text: `<b>My Ossetia</b> гордится тем, что производит и продает уникальные сувениры, демонстрирующие красоту и культурное наследие Осетии. Наши продукты тщательно изготавливаются с использованием современных технологий и материалов, в результате чего получаются высококачественные изделия, воплощающие дух и дизайн нашей нации. \n\n Мы считаем, что каждое изделие, которое мы создаем, должно рассказывать историю, поэтому мы тесно сотрудничаем с местными художниками и мастерами, чтобы воплотить богатое культурное наследие нашей нации в каждом изделии, которое мы создаем. \n\n <b>Наша миссия</b> – подарить нашим клиентам не просто сувенир, а частичку нашей нации, которую они смогут увезти с собой домой и хранить долгие годы. \n\n Если вы ищете особый подарок для любимого человека или память о ваших путешествиях, наши продукты — идеальный способ запечатлеть сущность Осетии и ее уникальное культурное наследие. \n\n Приходите к нам сегодня и откройте для себя мир сувениров, олицетворяющих красоту и дух Осетии.`
    }
  }
}  
</script>

<style lang="scss" scoped>
.about{
  padding: 16px;
  @media(min-width: 992px){
    padding: 32px;
  }
  @media(min-width: 1200px){
    width: 1000px;
    margin: 100px auto 100px;
  }
  h2{
    margin-bottom: 24px;
  }
  .text{
    white-space: pre-line;
  }
}

</style>
